<?php

// Видео 2_08. Тема: "Логические операции".
// Домашнее задание.
// Мои наработки

// Логические операции
$a = 5;
$b = 8;
echo "a = $a, b = $b<br />";
echo 'a > b : ' . ($a > $b) . "<br />";
echo 'a < b : ' . ($a < $b) . "<br />";
echo 'a == (равно) b : ' . ($a == $b) . "<br />";
$c = true;
$d = false;
echo "c = \"true\", d = \"false\"";
echo "<br />отрицание \"с\" равно " . !$c;
echo "<br />отрицание \"d\" равно " . !$d;
echo "<br />\"логическое и\" c и d равно " . ($c && $d);
echo "<br />\"логическое или\" c и d равно " . ($c || $d);
echo "<br />\"исключающее или\" c и d равно " . ($c xor $d);
$f = 7;
$g = '7';
echo "<br />f = $f; g = '$g'";
echo "<br />проверка на эквивалентность f и g (===) равна " . ($f === $g);
